
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       18 |           3 |           16 |
## Affected resources by action

|  Action  | Resources                                                                                                                                                 |
|:--------:|:----------------------------------------------------------------------------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_policy.runner_registration_permissions`                                                          |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_cloudwatch_log_group.lambda`                                                 |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_cloudwatch_metric_alarm.errors_threshold[0]`                                 |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_cloudwatch_metric_alarm.throttles[0]`                                        |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_iam_role.lambda`                                                             |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_iam_role_policy.lambda_logging`                                              |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_iam_role_policy.lambda_vpc_access[0]`                                        |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_iam_role_policy_attachment.additional[0]`                                    |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_lambda_function.this`                                                        |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_lambda_function_event_invoke_config.this`                                    |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_s3_object.lambda_package`                                                    |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_sns_topic.alarms`                                                            |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.aws_sns_topic_subscription.alarm_emails["alerts@infrahouse.com"]`                |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.null_resource.lambda_package`                                                    |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.module.lambda_bucket.aws_s3_bucket.this`                                         |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.module.lambda_bucket.aws_s3_bucket_policy.this`                                  |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.module.lambda_bucket.aws_s3_bucket_public_access_block.public_access`            |
|    🟢    | `module.actions-runner-noble.module.registration.module.lambda_monitored.module.lambda_bucket.aws_s3_bucket_server_side_encryption_configuration.default` |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`                                                                                        |
|    🟡    | `module.actions-runner-noble.aws_launch_template.actions-runner`                                                                                          |
|    🟡    | `module.actions-runner-noble.module.registration.aws_cloudwatch_event_target.scale-in-out`                                                                |
|    🔴    | `module.actions-runner-noble.aws_s3_bucket.lambda_tmp`                                                                                                    |
|    🔴    | `module.actions-runner-noble.aws_s3_bucket_policy.lambda_tmp`                                                                                             |
|    🔴    | `module.actions-runner-noble.aws_s3_bucket_public_access_block.public_access`                                                                             |
|    🔴    | `module.actions-runner-noble.module.registration.aws_cloudwatch_log_group.lambda`                                                                         |
|    🔴    | `module.actions-runner-noble.module.registration.aws_iam_policy.lambda_logging`                                                                           |
|    🔴    | `module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions`                                                                       |
|    🔴    | `module.actions-runner-noble.module.registration.aws_iam_role.lambda`                                                                                     |
|    🔴    | `module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`                                              |
|    🔴    | `module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess`                                             |
|    🔴    | `module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_logs`                                                              |
|    🔴    | `module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_permissions`                                                       |
|    🔴    | `module.actions-runner-noble.module.registration.aws_lambda_function.main`                                                                                |
|    🔴    | `module.actions-runner-noble.module.registration.aws_lambda_function_event_invoke_config.runner_registration`                                             |
|    🔴    | `module.actions-runner-noble.module.registration.aws_s3_object.lambda_package`                                                                            |
|    🔴    | `module.actions-runner-noble.module.registration.null_resource.install_python_dependencies`                                                               |
|    🔴    | `module.actions-runner-noble.module.registration.random_uuid.lamda_src_hash`                                                                              |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-20250505203133193000000009-KWX4No"
        name                             = "actions-runner-20250505203133193000000009-KWX4No"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "27" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      - tag {
          - key                 = "module_version" -> null
          - propagate_at_launch = true -> null
          - value               = "3.1.1" -> null
        }
      + tag {
          + key                 = "module_version"
          + propagate_at_launch = true
          + value               = "3.2.0"
        }

        # (13 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-0fe52afb929ab485f"
      ~ image_id                             = "ami-0059a9ae15f821dcc" -> "ami-0288c2420f25d4da5"
      ~ latest_version                       = 27 -> (known after apply)
        name                                 = "actions-runner-20250505203133193000000009"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_s3_bucket.lambda_tmp will be destroyed
  # (because aws_s3_bucket.lambda_tmp is not in configuration)
  - resource "aws_s3_bucket" "lambda_tmp" {
      - arn                         = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003" -> null
      - bucket                      = "infrahouse-action-runner-lambda-20250505203126845000000003" -> null
      - bucket_domain_name          = "infrahouse-action-runner-lambda-20250505203126845000000003.s3.amazonaws.com" -> null
      - bucket_prefix               = "infrahouse-action-runner-lambda-" -> null
      - bucket_regional_domain_name = "infrahouse-action-runner-lambda-20250505203126845000000003.s3.us-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2F56UZL2M1ACD" -> null
      - id                          = "infrahouse-action-runner-lambda-20250505203126845000000003" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/*",
                          - "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "account"           = "303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - tags_all                    = {
          - "account"           = "303467602807"
          - "created_by"        = "infrahouse/aws-control-303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "eb12b644232bddf2be57e9f92f01e0bbe02d5d81bcdc1af7b4f7e2ccbdbd4008" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.actions-runner-noble.aws_s3_bucket_policy.lambda_tmp will be destroyed
  # (because aws_s3_bucket_policy.lambda_tmp is not in configuration)
  - resource "aws_s3_bucket_policy" "lambda_tmp" {
      - bucket = "infrahouse-action-runner-lambda-20250505203126845000000003" -> null
      - id     = "infrahouse-action-runner-lambda-20250505203126845000000003" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/*",
                          - "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003",
                        ]
                      - Sid       = "AllowSSLRequestsOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.actions-runner-noble.aws_s3_bucket_public_access_block.public_access will be destroyed
  # (because aws_s3_bucket_public_access_block.public_access is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "public_access" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "infrahouse-action-runner-lambda-20250505203126845000000003" -> null
      - id                      = "infrahouse-action-runner-lambda-20250505203126845000000003" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_event_target.scale-in-out will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "scale-in-out" {
      ~ arn            = "arn:aws:lambda:us-west-1:303467602807:function:actions-runner-20250505203133193000000009-KWX4No_registration" -> (known after apply)
        id             = "actions-runner-2025050520313319300000020250505203139672500000018-terraform-2025050520315945070000002c"
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_log_group.lambda will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:us-west-1:303467602807:log-group:/aws/lambda/actions-runner-20250505203133193000000009-KWX4No_registration" -> null
      - id                = "/aws/lambda/actions-runner-20250505203133193000000009-KWX4No_registration" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/actions-runner-20250505203133193000000009-KWX4No_registration" -> null
      - retention_in_days = 365 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - tags_all          = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by"        = "infrahouse/aws-control-303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.lambda_logging will be destroyed
  # (because aws_iam_policy.lambda_logging is not in configuration)
  - resource "aws_iam_policy" "lambda_logging" {
      - arn              = "arn:aws:iam::303467602807:policy/lambda_logging2025050520315982340000002e" -> null
      - attachment_count = 1 -> null
      - description      = "IAM policy for logging from a lambda" -> null
      - id               = "arn:aws:iam::303467602807:policy/lambda_logging2025050520315982340000002e" -> null
      - name             = "lambda_logging2025050520315982340000002e" -> null
      - name_prefix      = "lambda_logging" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogStream"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-1:303467602807:log-group:/aws/lambda/actions-runner-20250505203133193000000009-KWX4No_registration"
                    },
                  - {
                      - Action   = "logs:PutLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUNKAUEN3X3GBXWJBD" -> null
      - tags             = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - tags_all         = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by"        = "infrahouse/aws-control-303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions will be destroyed
  # (because aws_iam_policy.lambda_permissions is not in configuration)
  - resource "aws_iam_policy" "lambda_permissions" {
      - arn              = "arn:aws:iam::303467602807:policy/lambda_permissions20250505203140140100000020" -> null
      - attachment_count = 1 -> null
      - description      = "IAM policy for a lambda permissions" -> null
      - id               = "arn:aws:iam::303467602807:policy/lambda_permissions20250505203140140100000020" -> null
      - name             = "lambda_permissions20250505203140140100000020" -> null
      - name_prefix      = "lambda_permissions" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "autoscaling:RecordLifecycleActionHeartbeat",
                          - "autoscaling:CompleteLifecycleAction",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:*:autoScalingGroupName/actions-runner-20250505203133193000000009-KWX4No"
                    },
                  - {
                      - Action   = [
                          - "ssm:SendCommand",
                          - "ssm:GetCommandInvocation",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeInstances",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ec2:CreateTags"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ec2:*:303467602807:instance/*"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:PutSecretValue",
                          - "secretsmanager:DescribeSecret",
                          - "secretsmanager:DeleteSecret",
                          - "secretsmanager:CreateSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-c7Iwrd-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAUNKAUEN345PEZ7X6D" -> null
      - tags             = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - tags_all         = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by"        = "infrahouse/aws-control-303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.runner_registration_permissions will be created
  + resource "aws_iam_policy" "runner_registration_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for runner_registration lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "actions-runner-20250505203133193000000009-KWX4No-runner-registration-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:RecordLifecycleActionHeartbeat",
                          + "autoscaling:CompleteLifecycleAction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:*:autoScalingGroupName/actions-runner-20250505203133193000000009-KWX4No"
                    },
                  + {
                      + Action   = [
                          + "ssm:SendCommand",
                          + "ssm:GetCommandInvocation",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ec2:CreateTags"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:*:303467602807:instance/*"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:PutSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:DeleteSecret",
                          + "secretsmanager:CreateSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-c7Iwrd-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.registration.aws_iam_role.lambda will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::303467602807:role/infrahouse-registration20250505203139737900000019" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-05T20:31:39Z" -> null
      - force_detach_policies = false -> null
      - id                    = "infrahouse-registration20250505203139737900000019" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::303467602807:policy/lambda_logging2025050520315982340000002e",
          - "arn:aws:iam::303467602807:policy/lambda_permissions20250505203140140100000020",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "infrahouse-registration20250505203139737900000019" -> null
      - name_prefix           = "infrahouse-registration" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - tags_all              = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by"        = "infrahouse/aws-control-303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - unique_id             = "AROAUNKAUEN362PFJ6GPY" -> null
        # (2 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be destroyed
  # (because aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      - id         = "infrahouse-registration20250505203139737900000019-20250505203140160600000021" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "infrahouse-registration20250505203139737900000019" -> null
    }

  # module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess will be destroyed
  # (because aws_iam_role_policy_attachment.AWSLambdaENIManagementAccess is not in configuration)
  - resource "aws_iam_role_policy_attachment" "AWSLambdaENIManagementAccess" {
      - id         = "infrahouse-registration20250505203139737900000019-20250513013546611100000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess" -> null
      - role       = "infrahouse-registration20250505203139737900000019" -> null
    }

  # module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_logs will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_logs is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_logs" {
      - id         = "infrahouse-registration20250505203139737900000019-20250505203200054300000030" -> null
      - policy_arn = "arn:aws:iam::303467602807:policy/lambda_logging2025050520315982340000002e" -> null
      - role       = "infrahouse-registration20250505203139737900000019" -> null
    }

  # module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_permissions will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_permissions is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      - id         = "infrahouse-registration20250505203139737900000019-20250505203140469500000022" -> null
      - policy_arn = "arn:aws:iam::303467602807:policy/lambda_permissions20250505203140140100000020" -> null
      - role       = "infrahouse-registration20250505203139737900000019" -> null
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function.main will be destroyed
  # (because aws_lambda_function.main is not in configuration)
  - resource "aws_lambda_function" "main" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-west-1:303467602807:function:actions-runner-20250505203133193000000009-KWX4No_registration" -> null
      - code_sha256                    = "RnilFQwJEIVd/O4IUUwl+ayGW5rHHgZypOaMheJVo2A=" -> null
      - function_name                  = "actions-runner-20250505203133193000000009-KWX4No_registration" -> null
      - handler                        = "main.lambda_handler" -> null
      - id                             = "actions-runner-20250505203133193000000009-KWX4No_registration" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:303467602807:function:actions-runner-20250505203133193000000009-KWX4No_registration/invocations" -> null
      - last_modified                  = "2025-08-23T13:50:17.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-1:303467602807:function:actions-runner-20250505203133193000000009-KWX4No_registration:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:303467602807:function:actions-runner-20250505203133193000000009-KWX4No_registration:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::303467602807:role/infrahouse-registration20250505203139737900000019" -> null
      - runtime                        = "python3.12" -> null
      - s3_bucket                      = "infrahouse-action-runner-lambda-20250505203126845000000003" -> null
      - s3_key                         = "a4834f11-bf71-f8e3-1d7d-77d44bf0c47b.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_size               = 22096373 -> null
      - tags                           = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - tags_all                       = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by"        = "infrahouse/aws-control-303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - timeout                        = 900 -> null
      - version                        = "$LATEST" -> null
        # (7 unchanged attributes hidden)

      - environment {
          - variables = {
              - "GH_APP_ID"                        = "1016363"
              - "GITHUB_ORG_NAME"                  = "infrahouse"
              - "GITHUB_SECRET"                    = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              - "GITHUB_SECRET_TYPE"               = "pem"
              - "LAMBDA_TIMEOUT"                   = "900"
              - "REGISTRATION_TOKEN_SECRET_PREFIX" = "GH-reg-token-c7Iwrd"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/actions-runner-20250505203133193000000009-KWX4No_registration" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - ipv6_allowed_for_dual_stack = false -> null
          - security_group_ids          = [
              - "sg-0bb31d7e35bcabcab",
            ] -> null
          - subnet_ids                  = [
              - "subnet-0a205209260302668",
              - "subnet-0a3a8e5a973c88986",
            ] -> null
          - vpc_id                      = "vpc-045eb4d598bc177c0" -> null
        }
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function_event_invoke_config.runner_registration will be destroyed
  # (because aws_lambda_function_event_invoke_config.runner_registration is not in configuration)
  - resource "aws_lambda_function_event_invoke_config" "runner_registration" {
      - function_name                = "actions-runner-20250505203133193000000009-KWX4No_registration" -> null
      - id                           = "actions-runner-20250505203133193000000009-KWX4No_registration" -> null
      - maximum_event_age_in_seconds = 0 -> null
      - maximum_retry_attempts       = 0 -> null
        # (1 unchanged attribute hidden)
    }

  # module.actions-runner-noble.module.registration.aws_s3_object.lambda_package will be destroyed
  # (because aws_s3_object.lambda_package is not in configuration)
  - resource "aws_s3_object" "lambda_package" {
      - arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/a4834f11-bf71-f8e3-1d7d-77d44bf0c47b.zip" -> null
      - bucket                        = "infrahouse-action-runner-lambda-20250505203126845000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "349ca40ff2286cbcdf5fffc1ae582a76" -> null
      - force_destroy                 = false -> null
      - id                            = "a4834f11-bf71-f8e3-1d7d-77d44bf0c47b.zip" -> null
      - key                           = "a4834f11-bf71-f8e3-1d7d-77d44bf0c47b.zip" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = ".terraform/modules/actions-runner-noble/modules/runner_registration/a4834f11-bf71-f8e3-1d7d-77d44bf0c47b.zip" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - tags_all                      = {
          - "account"           = "303467602807"
          - "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          - "created_by"        = "infrahouse/aws-control-303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.null_resource.install_python_dependencies will be destroyed
  # (because null_resource.install_python_dependencies is not in configuration)
  - resource "null_resource" "install_python_dependencies" {
      - id       = "1062992499731199467" -> null
      - triggers = {
          - "dependencies_version" = "1b4f2e5df0952f73ce2c136e0447090b"
          - "main_version"         = "daed8b359d82cc0754c16ab3a3fe1770"
        } -> null
    }

  # module.actions-runner-noble.module.registration.random_uuid.lamda_src_hash will be destroyed
  # (because random_uuid.lamda_src_hash is not in configuration)
  - resource "random_uuid" "lamda_src_hash" {
      - id      = "a4834f11-bf71-f8e3-1d7d-77d44bf0c47b" -> null
      - keepers = {
          - "main.py"          = "daed8b359d82cc0754c16ab3a3fe1770"
          - "requirements.txt" = "1b4f2e5df0952f73ce2c136e0447090b"
        } -> null
      - result  = "a4834f11-bf71-f8e3-1d7d-77d44bf0c47b" -> null
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/actions-runner-20250505203133193000000009-KWX4No_registration"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_cloudwatch_metric_alarm.errors_threshold[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "errors_threshold" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Lambda function actions-runner-20250505203133193000000009-KWX4No_registration error rate exceeds 10%"
      + alarm_name                            = "actions-runner-20250505203133193000000009-KWX4No_registration-errors-threshold"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags                                  = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "errors"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "actions-runner-20250505203133193000000009-KWX4No_registration"
                }
              + metric_name = "Errors"
              + namespace   = "AWS/Lambda"
              + period      = 60
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + id          = "invocations"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "actions-runner-20250505203133193000000009-KWX4No_registration"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 60
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "(errors / invocations) * 100"
          + id          = "error_rate"
          + label       = "Error Rate (%)"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_cloudwatch_metric_alarm.throttles[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "throttles" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Lambda function actions-runner-20250505203133193000000009-KWX4No_registration is being throttled"
      + alarm_name                            = "actions-runner-20250505203133193000000009-KWX4No_registration-throttles"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "actions-runner-20250505203133193000000009-KWX4No_registration"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Throttles"
      + namespace                             = "AWS/Lambda"
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "actions-runner-2025050520313319300000-"
      + path                  = "/"
      + tags                  = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "function_name"     = "actions-runner-20250505203133193000000009-KWX4No_registration"
          + "service"           = "actions-runner"
        }
      + tags_all              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "function_name"     = "actions-runner-20250505203133193000000009-KWX4No_registration"
          + "service"           = "actions-runner"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_iam_role_policy.lambda_logging will be created
  + resource "aws_iam_role_policy" "lambda_logging" {
      + id          = (known after apply)
      + name        = "actions-runner-20250505203133193000000009-KWX4No_registration-logging"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_iam_role_policy.lambda_vpc_access[0] will be created
  + resource "aws_iam_role_policy" "lambda_vpc_access" {
      + id          = (known after apply)
      + name        = "actions-runner-20250505203133193000000009-KWX4No_registration-vpc-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:DescribeNetworkInterfaces"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DescribeNetworkInterfaces"
                    },
                  + {
                      + Action   = "ec2:CreateNetworkInterface"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:us-west-1:303467602807:subnet/subnet-0a3a8e5a973c88986",
                          + "arn:aws:ec2:us-west-1:303467602807:subnet/subnet-0a205209260302668",
                          + "arn:aws:ec2:us-west-1:303467602807:security-group/sg-0bb31d7e35bcabcab",
                          + "arn:aws:ec2:us-west-1:303467602807:network-interface/*",
                        ]
                      + Sid      = "CreateNetworkInterface"
                    },
                  + {
                      + Action   = "ec2:DeleteNetworkInterface"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:us-west-1:303467602807:*/*"
                      + Sid      = "DeleteNetworkInterface"
                    },
                  + {
                      + Action    = [
                          + "ec2:UnassignPrivateIpAddresses",
                          + "ec2:AssignPrivateIpAddresses",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ec2:Subnet" = [
                                  + "arn:aws:ec2:us-west-1:303467602807:subnet/subnet-0a3a8e5a973c88986",
                                  + "arn:aws:ec2:us-west-1:303467602807:subnet/subnet-0a205209260302668",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:us-west-1:303467602807:network-interface/*"
                      + Sid       = "ManageNetworkInterfaceIPs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_iam_role_policy_attachment.additional[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Lambda function actions-runner-20250505203133193000000009-KWX4No_registration"
      + function_name                  = "actions-runner-20250505203133193000000009-KWX4No_registration"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "actions-runner-20250505203133193000000009-KWX4No_registration/0706efa4ff6b03be4d318a214e560072.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "MDcwNmVmYTRmZjZiMDNiZTRkMzE4YTIxNGU1NjAwNzI="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "module_version"    = "1.0.4"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "module_version"    = "1.0.4"
          + "service"           = "actions-runner"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GH_APP_ID"                        = "1016363"
              + "GITHUB_ORG_NAME"                  = "infrahouse"
              + "GITHUB_SECRET"                    = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              + "GITHUB_SECRET_TYPE"               = "pem"
              + "LAMBDA_TIMEOUT"                   = "900"
              + "REGISTRATION_TOKEN_SECRET_PREFIX" = "GH-reg-token-c7Iwrd"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0bb31d7e35bcabcab",
            ]
          + subnet_ids                  = [
              + "subnet-0a205209260302668",
              + "subnet-0a3a8e5a973c88986",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_lambda_function_event_invoke_config.this will be created
  + resource "aws_lambda_function_event_invoke_config" "this" {
      + function_name          = "actions-runner-20250505203133193000000009-KWX4No_registration"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "actions-runner-20250505203133193000000009-KWX4No_registration/0706efa4ff6b03be4d318a214e560072.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./.build/actions-runner-20250505203133193000000009-KWX4No_registration-0706efa4ff6b03be4d318a214e560072.zip"
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_sns_topic.alarms will be created
  + resource "aws_sns_topic" "alarms" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "actions-runner-20250505203133193000000009-KWX4No_registration-alarms"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                    = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tracing_config              = (known after apply)
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.aws_sns_topic_subscription.alarm_emails["alerts@infrahouse.com"] will be created
  + resource "aws_sns_topic_subscription" "alarm_emails" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "alerts@infrahouse.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.null_resource.lambda_package will be created
  + resource "null_resource" "lambda_package" {
      + id       = (known after apply)
      + triggers = {
          + "architecture"      = "x86_64"
          + "function_name"     = "actions-runner-20250505203133193000000009-KWX4No_registration"
          + "module_version"    = "1.0.4"
          + "package_hash"      = "0706efa4ff6b03be4d318a214e560072"
          + "python_version"    = "python3.12"
          + "requirements_hash" = "1b4f2e5df0952f73ce2c136e0447090b"
          + "source_hash"       = "e82d94fa602aa787fae60a637bc2c688"
        }
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.module.lambda_bucket.data.aws_iam_policy_document.bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + null,
          + (known after apply),
        ]
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.module.lambda_bucket.data.aws_iam_policy_document.enforce_ssl_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "enforce_ssl_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.module.lambda_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "actions-runner-2025050520313319300000"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "function_name"     = "actions-runner-20250505203133193000000009-KWX4No_registration"
          + "module_version"    = "0.2.0"
          + "service"           = "actions-runner"
        }
      + tags_all                    = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/lambda-monitored/aws"
          + "environment"       = "development"
          + "function_name"     = "actions-runner-20250505203133193000000009-KWX4No_registration"
          + "module_version"    = "0.2.0"
          + "service"           = "actions-runner"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.module.lambda_bucket.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.module.lambda_bucket.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.actions-runner-noble.module.registration.module.lambda_monitored.module.lambda_bucket.aws_s3_bucket_server_side_encryption_configuration.default will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

Plan: 18 to add, 3 to change, 16 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDE4LCAiY2hhbmdlIjogMywgImRlc3Ryb3kiOiAxNn19
```
</details>